#+title: Timestamp Analsysis
The goal is to find a method of accurately matching data coming from a microcontroller to data collected on a host computer. This analysis aims to determine the accuracy of NTP timestamps on the ESP32 using the [[https://github.com/ropg/ezTime][ezTime]] library.
** Analysis
#+name: analyze
#+header: :var input_vals=timestamps_sample
#+begin_src python
from statistics import mean, median
differences = []
for host, mcu in input_vals:
    differences.append(host-mcu)

return median(differences), mean(differences)
#+end_src

#+RESULTS: Analysis of 1000 data points 2024-01-07
| -15.0 | -14.998 |


#+RESULTS: Analysis 1000 data points 2024-01-06
| -12.0 | -12 |
